11/data/attachments/995988c98c0eeb70.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d9d3eed9-e509-469f-aa10-3f2a6f815ba9</nif:username>
            <nif:friendToBeAdded>Michael_dinner_Friend_24913_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>